app/Controllers/ExController.php

    public function index()
    {
        $cata = new CateModel();
        $data['category'] = $cata->findAll();
---
SELECT *
FROM `category`