app/Controllers/InController.php

    public function index()
    {   $InView = new IncModel();
        $data['inCategory'] = $InView->orderBy('inc_id', 'DESC')->findAll();
---
SELECT *
FROM `in_category`
ORDER BY `inc_id` DESC