app/Controllers/Register.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('admin', 'admin@gmail.com', '$2y$10$lyNLSHd1136EIbII0cSOz.BGhn6oQ/oAHVnXfJzBU4V4Z32/UIgJK')
---
    public function store()
    {
        helper(['form']);
        $rules = [
            'name'          => 'required',
            'email'         => 'required|min_length[4]|max_length[100]|valid_email|is_unique[users.email]',
            'password'      => 'required|min_length[4]|max_length[50]',
            'confirmpassword'  => 'matches[password]'
        ];

        if($this->validate($rules)){
            $userModel = new UserModel();
            $data = [
                'name'     => $this->request->getVar('name'),
                'email'    => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $userModel->save($data);